Repository: chickazee4/starling
Catalog: locale/*.po
Languages: ru

source: character
ru: символы

source: currency
ru: деньги

source: date
ru: срок

source: time
ru: время

source: double
ru: двойной

source: float
ru: поплавок

source: general
ru: общая

source: integer
ru: целое число

source: logical
ru: логическая

source: memo
ru: мемо

source: numeric
ru: число

source: picture
ru: изображение

source: internal_name
ru: внутренное_название

source: human_name
ru: название_для_людей

source: type
ru: тип

source: length
ru: длина

source: name
ru: название

source: You must specify an argument with the -d flag.
ru: С указателем -d необходимо определить параметр.

source: You must specify an argument with the -i flag.
ru: С указателем -i необходимо определить параметр.

source: You must specify an argument with the -o flag.
ru: С указателем -o необходимо определить параметр.

source: You must specify an argument with the -v flag.
ru: С указателем -v необходимо определить параметр.

source: You must specify a database!
ru: Необходимо определить базу данных!

source: Warning: The database you're trying to load is known to cause crashes.
ru: Замечание: Известно, что база данных, которую вы пытаетесь загрузить, вызывает сбои.

source: Error: The database you're trying to load is known to cause crashes. Loading has been suppressed.
ru: Ошибка: Известно, что база данных, которую вы пытаетесь загрузить, вызывает сбои. Загрузка остановилась.

source: Accessing and parsing database...
ru: Доступ и разбор базы данных...

source: Error
ru: Ошибка

source: Parser tried to exceed length of database
ru: Парсер попробовал переступить длину базы данных

source: Invalid record (delete flag not detected; check for database corruption)
ru: Неверная запись (флаг удаления не найден; ищите коррупции в базе данных)

source: Invalid header (check for database corruption)
ru: Неверный заголовок (ищите коррупции в базе данных)

source: Invalid var file
ru: Неверный файл .var

source: Error: Specified -I flag, but no .inf file exists and none was provided.
ru: Ошибка: Определен флаг -I, но не удалось автоматически найти файл .inf и название не определено пользователем.

source: Dereferencing external variables and decoding...
ru: Разыменование внешних переменных и декодирование...

source: Eureka!
ru: Ура!

source: Database last updated
ru: База данных была изменена

source: Number of records
ru: Подсчет записей

source: Number of fields
ru: Подсчет полей

source: Database summary
ru: Резюме базы данных

source: Fields
ru: Поля

source: human name
ru: название для людей

source: Generating table...
ru: Создание таблицы...

source: Error in table creation!
ru: Ошибка в создании таблицы!

source: Writing to file...
ru: Сохранение...

source: Warning: specified output file is in a location that does not exist or is inaccessible. Writing to stdout instead.
ru: Замечание: определенный файл находится в месте, которое не существует или этой программе не доступно. Результаты написаны в stdout.
